{"config": [{"config": {"dim_ordering": "tf", "nb_col": 5, "bias": true, "activity_regularizer": null, "b_constraint": null, "nb_filter": 24, "border_mode": "valid", "W_regularizer": null, "W_constraint": null, "name": "convolution2d_1", "input_dtype": "float32", "nb_row": 5, "activation": "relu", "batch_input_shape": [null, 89, 320, 3], "subsample": [2, 2], "b_regularizer": null, "trainable": true, "init": "normal"}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "nb_col": 5, "activity_regularizer": null, "bias": true, "b_constraint": null, "nb_filter": 36, "border_mode": "valid", "W_regularizer": null, "W_constraint": null, "name": "convolution2d_2", "nb_row": 5, "activation": "relu", "subsample": [2, 2], "b_regularizer": null, "trainable": true, "init": "normal"}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "nb_col": 5, "activity_regularizer": null, "bias": true, "b_constraint": null, "nb_filter": 48, "border_mode": "valid", "W_regularizer": null, "W_constraint": null, "name": "convolution2d_3", "nb_row": 5, "activation": "relu", "subsample": [2, 2], "b_regularizer": null, "trainable": true, "init": "normal"}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "nb_col": 3, "activity_regularizer": null, "bias": true, "b_constraint": null, "nb_filter": 64, "border_mode": "valid", "W_regularizer": null, "W_constraint": null, "name": "convolution2d_4", "nb_row": 3, "activation": "relu", "subsample": [1, 1], "b_regularizer": null, "trainable": true, "init": "normal"}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "nb_col": 3, "activity_regularizer": null, "bias": true, "b_constraint": null, "nb_filter": 64, "border_mode": "valid", "W_regularizer": null, "W_constraint": null, "name": "convolution2d_5", "nb_row": 3, "activation": "relu", "subsample": [1, 1], "b_regularizer": null, "trainable": true, "init": "normal"}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"p": 0.5, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"b_constraint": null, "activity_regularizer": null, "bias": true, "input_dim": 8448, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "W_constraint": null, "name": "dense_1", "trainable": true, "activation": "relu", "b_regularizer": null, "output_dim": 100, "init": "normal"}, "class_name": "Dense"}, {"config": {"b_constraint": null, "activity_regularizer": null, "bias": true, "input_dim": 100, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.004999999888241291}, "W_constraint": null, "name": "dense_2", "trainable": true, "activation": "relu", "b_regularizer": null, "output_dim": 50, "init": "normal"}, "class_name": "Dense"}, {"config": {"b_constraint": null, "activity_regularizer": null, "bias": true, "input_dim": 50, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.009999999776482582}, "W_constraint": null, "name": "dense_3", "trainable": true, "activation": "relu", "b_regularizer": null, "output_dim": 10, "init": "normal"}, "class_name": "Dense"}, {"config": {"b_constraint": null, "activity_regularizer": null, "bias": true, "input_dim": 10, "W_regularizer": null, "W_constraint": null, "name": "dense_4", "trainable": true, "activation": "linear", "b_regularizer": null, "output_dim": 1, "init": "glorot_uniform"}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.1"}