{"config": [{"config": {"batch_input_shape": [null, 89, 320, 4], "nb_filter": 32, "activity_regularizer": null, "input_dtype": "float32", "dim_ordering": "tf", "nb_row": 5, "init": "normal", "bias": true, "trainable": true, "b_constraint": null, "name": "convolution2d_1", "activation": "relu", "border_mode": "valid", "W_regularizer": null, "subsample": [2, 2], "nb_col": 5, "W_constraint": null, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"nb_filter": 48, "activity_regularizer": null, "dim_ordering": "tf", "nb_row": 5, "init": "normal", "bias": true, "trainable": true, "b_constraint": null, "name": "convolution2d_2", "activation": "relu", "border_mode": "valid", "W_regularizer": null, "subsample": [2, 2], "nb_col": 5, "W_constraint": null, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"nb_filter": 64, "activity_regularizer": null, "dim_ordering": "tf", "nb_row": 5, "init": "normal", "bias": true, "trainable": true, "b_constraint": null, "name": "convolution2d_3", "activation": "relu", "border_mode": "valid", "W_regularizer": null, "subsample": [2, 2], "nb_col": 5, "W_constraint": null, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"nb_filter": 86, "activity_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "init": "normal", "bias": true, "trainable": true, "b_constraint": null, "name": "convolution2d_4", "activation": "relu", "border_mode": "valid", "W_regularizer": null, "subsample": [1, 1], "nb_col": 3, "W_constraint": null, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"nb_filter": 86, "activity_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "init": "normal", "bias": true, "trainable": true, "b_constraint": null, "name": "convolution2d_5", "activation": "relu", "border_mode": "valid", "W_regularizer": null, "subsample": [1, 1], "nb_col": 3, "W_constraint": null, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"p": 0.5, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"input_dim": 11352, "activity_regularizer": null, "output_dim": 134, "init": "normal", "bias": true, "b_constraint": null, "name": "dense_1", "activation": "relu", "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}, "trainable": true, "W_constraint": null, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"input_dim": 134, "activity_regularizer": null, "output_dim": 67, "init": "normal", "bias": true, "b_constraint": null, "name": "dense_2", "activation": "relu", "W_regularizer": {"l2": 0.004999999888241291, "name": "L1L2Regularizer", "l1": 0.0}, "trainable": true, "W_constraint": null, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"input_dim": 67, "activity_regularizer": null, "output_dim": 14, "init": "normal", "bias": true, "b_constraint": null, "name": "dense_3", "activation": "relu", "W_regularizer": {"l2": 0.009999999776482582, "name": "L1L2Regularizer", "l1": 0.0}, "trainable": true, "W_constraint": null, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"input_dim": 14, "activity_regularizer": null, "output_dim": 1, "init": "glorot_uniform", "bias": true, "b_constraint": null, "name": "dense_4", "activation": "linear", "W_regularizer": null, "trainable": true, "W_constraint": null, "b_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.1"}